; domain
(define (domain delivery)
  (:requirements :strips :adl)
  (:types agent position)
  (:predicates 
    (inc ?a ?b - position)
    (dec ?a ?b - position)
    (at ?a - agent ?x ?y - position)
    (hole ?x ?y)
    (picked-up ?x ?y)
    (food-at ?x ?y - position)
    )
   
  (:action 
    north
    :parameters (?car - agent)
    :precondition ()
    :effect (forall (?x ?y ?yn - position)
                    (when 
                      (and (at ?car ?x ?y)
                           (dec ?y ?yn)
                           (not (hole ?x ?yn))
                      )
                      (and (not (at ?car ?x ?y))
                           (at ?car ?x ?yn))
                    )
            )
  )

  (:action 
    south
    :parameters (?car - agent)
    :precondition ()
    :effect (forall (?x ?y ?yn - position)
                    (when 
                      (and (at ?car ?x ?y)
                           (inc ?y ?yn)
                           (not (hole ?x ?yn))
                      )
                      (and (not (at ?car ?x ?y))
                                (at ?car ?x ?yn)
                      )
                    )
            )
  )

  (:action 
    east
    :parameters (?car - agent)
    :precondition ()
    :effect (forall (?x ?y ?xn - position)
                    (when 
                      (and (at ?car ?x ?y)
                           (inc ?x ?xn)
                           (not (hole ?xn ?y)
                      )
                    )
                      (and (not (at ?car ?x ?y))
                                (at ?car ?xn ?y))
                      )
              )
  )

  (:action 
    west
    :parameters (?car - agent)
    :precondition ()
    :effect (forall (?x ?y ?xn - position)
                    (when 
                      (and (at ?car ?x ?y)
                           (dec ?x ?xn)
                           (not (hole ?xn ?y)
                      )
                    )
                      (and (not (at ?car ?x ?y))
                                (at ?car ?xn ?y)
                      )
                    )
            )
  )

  (:action 
    pick-up
    :parameters (?car - agent)
    :precondition ()
    :effect (forall (?x ?y - position)
                    (when 
                      (and (at ?car ?x ?y)
                           (food-at ?x ?y)
                      )
                      (picked-up ?x ?y)
                    )
            )
  )

)

; problem
(define (problem delivery1)
  (:domain delivery)
  (:objects x1 x2 x3 x4 x5 x6 y1 y2 y3 y4 y5 y6 - position car - agent)
  (:init
   (inc x1 x2)
   (dec y1 y2)
   (inc y2 y1)
   (dec x2 x1)
   (inc x2 x3)
   (dec y2 y3)
   (inc y3 y2)
   (dec x3 x2)
   (inc x3 x4)
   (dec y3 y4)
   (inc y4 y3)
   (dec x4 x3)
   (inc x4 x5)
   (dec y4 y5)
   (inc y5 y4)
   (dec x5 x4)
   (inc x5 x6)
   (dec y5 y6)
   (inc y6 y5)
   (dec x6 x5)
   (hole x1 y4)
   (hole x2 y2)
   (hole x2 y4)
   (hole x3 y2)
   (hole x3 y4)
   (hole x4 y2)
   (hole x4 y4)
   (hole x5 y3)
   (food-at x6 y1)
   (at car x4 y1))
 (:goal
(and (picked-up x6 y1) (at car x4 y3))))

; plan
1. (east car)
   deleted: (at car x4 y1)
   added: (at car x5 y1)
   goals met: 0 of 2
2. (east car)
   deleted: (at car x5 y1)
   added: (at car x6 y1)
   goals met: 0 of 2
3. (pick-up car)
   added: (picked-up x6 y1)
   goals met: 1 of 2
4. (west car)
   deleted: (at car x6 y1)
   added: (at car x5 y1)
   goals met: 1 of 2
5. (west car)
   deleted: (at car x5 y1)
   added: (at car x4 y1)
   goals met: 1 of 2
6. (west car)
   deleted: (at car x4 y1)
   added: (at car x3 y1)
   goals met: 1 of 2
7. (west car)
   deleted: (at car x3 y1)
   added: (at car x2 y1)
   goals met: 1 of 2
8. (west car)
   deleted: (at car x2 y1)
   added: (at car x1 y1)
   goals met: 1 of 2
9. (north car)
   deleted: (at car x1 y1)
   added: (at car x1 y2)
   goals met: 1 of 2
10. (north car)
   deleted: (at car x1 y2)
   added: (at car x1 y3)
   goals met: 1 of 2
11. (east car)
   deleted: (at car x1 y3)
   added: (at car x2 y3)
   goals met: 1 of 2
12. (east car)
   deleted: (at car x2 y3)
   added: (at car x3 y3)
   goals met: 1 of 2
13. (east car)
   deleted: (at car x3 y3)
   added: (at car x4 y3)
   goals met: 2 of 2
